In [118]:
import pandas as pd

# Employee information DataFrame
df_employees = pd.DataFrame({
    'EmpID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Position': ['Manager', 'Engineer', 'Analyst', 'Clerk']
})

# Department information DataFrame
df_departments = pd.DataFrame({
    'EmpID': [1, 2, 4, 5],
    'Department': ['HR', 'Engineering', 'Finance', 'IT'],
    'Location': ['New York', 'San Francisco', 'Boston', 'Los Angeles']
})

# Salary information DataFrame
df_salary = pd.DataFrame({
    'EmpID': [1, 2, 3],
    'Salary': [70000, 80000, 50000]
})

In [119]:
df_inner = df_employees.merge(df_departments, on='EmpID', how='inner')
print(df_inner)

   EmpID   Name  Position   Department       Location
0      1  Alice   Manager           HR       New York
1      2    Bob  Engineer  Engineering  San Francisco
2      4  David     Clerk      Finance         Boston

In [120]:
df_left = df_employees.merge(df_departments, on='EmpID', how='left')
print(df_left)

   EmpID     Name  Position   Department       Location
0      1    Alice   Manager           HR       New York
1      2      Bob  Engineer  Engineering  San Francisco
2      3  Charlie   Analyst          NaN            NaN
3      4    David     Clerk      Finance         Boston

In [121]:
df_right = df_employees.merge(df_departments, on='EmpID', how='right')
print(df_right)

   EmpID   Name  Position   Department       Location
0      1  Alice   Manager           HR       New York
1      2    Bob  Engineer  Engineering  San Francisco
2      4  David     Clerk      Finance         Boston
3      5    NaN       NaN           IT    Los Angeles

In [122]:
df_outer = df_employees.merge(df_departments, on='EmpID', how='outer')
print(df_outer)

   EmpID     Name  Position   Department       Location
0      1    Alice   Manager           HR       New York
1      2      Bob  Engineer  Engineering  San Francisco
2      3  Charlie   Analyst          NaN            NaN
3      4    David     Clerk      Finance         Boston
4      5      NaN       NaN           IT    Los Angeles

Join Using join() Method

In [123]:
df_join = df_employees.set_index('EmpID').join(df_departments.set_index('EmpID'), how='outer')
print(df_join)

          Name  Position   Department       Location
EmpID
1        Alice   Manager           HR       New York
2          Bob  Engineer  Engineering  San Francisco
3      Charlie   Analyst          NaN            NaN
4        David     Clerk      Finance         Boston
5          NaN       NaN           IT    Los Angeles

OR

In [124]:
# Employee information DataFrame
df_employees2 = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Position': ['Manager', 'Engineer', 'Analyst']
}, index=[1, 2, 3])

# Department information DataFrame
df_departments2 = pd.DataFrame({
    'Department': ['HR', 'Engineering', 'Finance'],
    'Location': ['New York', 'San Francisco', 'Boston']
}, index=[1, 2, 4])

In [125]:
df_combined2 = df_employees2.join(df_departments2, how='outer')
df_combined2

      Name  Position   Department       Location
1    Alice   Manager           HR       New York
2      Bob  Engineer  Engineering  San Francisco
3  Charlie   Analyst          NaN            NaN
4      NaN       NaN      Finance         Boston

In [126]:
import pandas as pd

df3 = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 90, 95],
    'Science': [88, 92, 98],
    'English': [77, 85, 90]
})
df3

      Name  Math  Science  English
0    Alice    85       88       77
1      Bob    90       92       85
2  Charlie    95       98       90

In [127]:
df_melt2=pd.melt(df3,id_vars=['Name'], var_name='Subject',value_name='Score')
df_melt2

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     90
2  Charlie     Math     95
3    Alice  Science     88
4      Bob  Science     92
5  Charlie  Science     98
6    Alice  English     77
7      Bob  English     85
8  Charlie  English     90

In [138]:
pivot_df=df_melt2.pivot_table( index= ['Name'], columns='Subject', values='Score')
pivot_df.columns.name = None  # Removes the 'Subject' heading
pivot_df = pivot_df.reset_index()  # Ensures column names are in a single row
pivot_df

      Name  English  Math  Science
0    Alice       77    85       88
1      Bob       85    90       92
2  Charlie       90    95       98

In [129]:
# Sample DataFrame
data4 = {
    'Region': ['North', 'South', 'North', 'East', 'South', 'West', 'East', 'West'],
    'Year': [2022, 2022, 2023, 2023, 2022, 2023, 2022, 2023],
    'Sales': [500, 700, 450, 800, 600, 650, 750, 700]
}

df4 = pd.DataFrame(data4)
df4

  Region  Year  Sales
0  North  2022    500
1  South  2022    700
2  North  2023    450
3   East  2023    800
4  South  2022    600
5   West  2023    650
6   East  2022    750
7   West  2023    700

In [130]:
# Pivot Table - Summing Sales by Region and Year
pivot_df4 = df4.pivot_table(index='Region', columns='Year', values='Sales', aggfunc='sum')

pivot_df4

Year      2022    2023
Region
East     750.0   800.0
North    500.0   450.0
South   1300.0     NaN
West       NaN  1350.0

In [131]:
data5 = {
    'Department': ['IT', 'HR', 'IT', 'Finance', 'HR', 'Finance', 'IT', 'HR'],
    'Experience': ['Junior', 'Senior', 'Mid', 'Senior', 'Mid', 'Junior', 'Senior', 'Mid'],
    'Salary': [60000, 75000, 70000, 80000, 65000, 62000, 85000, 70000]
}

df5 = pd.DataFrame(data5)
df5

  Department Experience  Salary
0         IT     Junior   60000
1         HR     Senior   75000
2         IT        Mid   70000
3    Finance     Senior   80000
4         HR        Mid   65000
5    Finance     Junior   62000
6         IT     Senior   85000
7         HR        Mid   70000

In [132]:
# Pivot Table - Average Salary by Department and Experience Level
pivot_df5 = df5.pivot_table(index='Department', columns='Experience', values='Salary', aggfunc='mean')

print(pivot_df5)

Experience   Junior      Mid   Senior
Department
Finance     62000.0      NaN  80000.0
HR              NaN  67500.0  75000.0
IT          60000.0  70000.0  85000.0

In [133]:
grouped_df = df4.groupby('Region')['Sales'].sum()
grouped_df

Region
East     1550
North     950
South    1300
West     1350
Name: Sales, dtype: int64

In [134]:
grouped_df5 = df5.groupby(['Department', 'Experience'])['Salary'].mean()
grouped_df5

Department  Experience
Finance     Junior        62000.0
            Senior        80000.0
HR          Mid           67500.0
            Senior        75000.0
IT          Junior        60000.0
            Mid           70000.0
            Senior        85000.0
Name: Salary, dtype: float64

In [135]:


# Sample DataFrame df6 with additional columns
data6 = {
    'Employee ID': [101, 102, 103, 104, 105, 106, 107, 108],
    'Department': ['IT', 'HR', 'IT', 'Finance', 'HR', 'Finance', 'IT', 'HR'],
    'Experience': ['Junior', 'Senior', 'Mid', 'Senior', 'Mid', 'Junior', 'Senior', 'Mid'],
    'Salary': [60000, 75000, 70000, 80000, 65000, 62000, 85000, 70000],
    'Age': [25, 40, 28, 35, 30, 27, 36, 29]
}
df6 = pd.DataFrame(data6)
df6

   Employee ID Department Experience  Salary  Age
0          101         IT     Junior   60000   25
1          102         HR     Senior   75000   40
2          103         IT        Mid   70000   28
3          104    Finance     Senior   80000   35
4          105         HR        Mid   65000   30
5          106    Finance     Junior   62000   27
6          107         IT     Senior   85000   36
7          108         HR        Mid   70000   29

In [136]:
# Creating pivot table with Salary (mean), Age (mean), and Employee ID (count)
pivot_df6 = df6.pivot_table(
    index='Department', 
    columns='Experience', 
    values=['Salary', 'Age'], 
    aggfunc={'Salary': 'mean', 'Age': 'mean'}
)
pivot_df6

              Age                Salary
Experience Junior   Mid Senior   Junior      Mid   Senior
Department
Finance      27.0   NaN   35.0  62000.0      NaN  80000.0
HR            NaN  29.5   40.0      NaN  67500.0  75000.0
IT           25.0  28.0   36.0  60000.0  70000.0  85000.0